<h1> SF Salaries Exercise and Solution </h1>

Welcome to a quick exercise for you to practice your pandas skills:

In [2]:
import numpy as np
import pandas as pd

<b>Read Salaries.csv as a dataframe called sal?</b>

In [3]:
sal = pd.read_csv("Salaries.csv")

C:\Users\IT Center\AppData\Local\Temp\ipykernel_5900\2865795940.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal = pd.read_csv("Salaries.csv")

<b>Check the head of the DataFrame?</b>

In [4]:
sal.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

<b>Get some info about Dataset?</b>

In [5]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

<b> Preprocess the Dataset</b>

In [6]:
sal["BasePay"].replace("Not Provided", "0.00",inplace=True)

<b>What is the average BasePay?</b>

In [7]:
sal["BasePay"] = sal["BasePay"].astype(np.float32)

In [8]:
sal["BasePay"].mean()

66317.734375

In [9]:
sal.replace("Not Provided", "0.00", inplace=True)

In [10]:
sal["OvertimePay"] = sal["OvertimePay"].astype(np.float32)

<b>What is the highest amount of OvertimePay in the dataset?</b>

In [11]:
max(sal["OvertimePay"])

245131.875

In [12]:
sal["OvertimePay"].max()

245131.875

<b>What is the job title of JOSEPH DRISCOLL?</b>

In [13]:
sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

<b>How much does JOSEPH DRISCOLL make(including benefits) </b>

In [14]:
Joseph_income = sal[sal["EmployeeName"]=="JOSEPH DRISCOLL"]

In [15]:
Joseph_income

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.859375,97868.773438,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

In [16]:
Joseph_income["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [17]:
Joseph_income

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
24,25,JOSEPH DRISCOLL,"CAPTAIN, FIRE SUPPRESSION",140546.859375,97868.773438,31909.28,NaN,270324.91,270324.91,2011,NaN,San Francisco,NaN

<b>What is the name of highest paid person?(including benefits)</b>

In [18]:
sal["TotalPay"] = sal["TotalPay"].astype(np.float32)
sal["TotalPayBenefits"] = sal["TotalPayBenefits"].astype(np.float32)

In [19]:
sal.loc[sal["TotalPayBenefits"].idxmax()]["EmployeeName"]

'NATHANIEL FORD'

In [20]:
sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.1875,0.0,400184.25,NaN,567595.4375,567595.4375,2011,NaN,San Francisco,NaN

In [21]:
sal[sal["TotalPayBenefits"] == sal["TotalPayBenefits"].max()]["EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object

<b>What is the name of lowest paid person?(including benefits)</b>

In [22]:
sal.loc[sal["TotalPayBenefits"].idxmin()]["EmployeeName"]

'Joe Lopez'

<b> What was the average(mean) BasePay of all employees per year?<br>(2011-2014)?</b>

In [23]:
sal.groupby(by="Year").mean()

,Id,BasePay,OvertimePay,TotalPay,TotalPayBenefits,Notes
Year,,,,,,
2011,18080.0,63595.957031,4531.065430,71744.101562,71744.101562,NaN
2012,54542.5,65436.406250,5023.417969,74113.265625,100553.226562,NaN
2013,91728.5,69630.031250,5281.642090,77611.445312,101440.523438,NaN
2014,129593.0,66557.437500,5401.426758,75463.921875,100250.921875,NaN

In [24]:
sal.groupby(by="Year").mean()["BasePay"]

Year
2011    63595.957031
2012    65436.406250
2013    69630.031250
2014    66557.437500
Name: BasePay, dtype: float32

<b>How many unique jobe titles are there?</b>

In [25]:
sal["JobTitle"].nunique()

2159

<b>What are the top 5 most common jobs?</b>

In [26]:
sal["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

<b>How many Job titles were represented by only one person in 2013?</b>

In [27]:
sum(sal[sal['Year']==2013]['JobTitle'].value_counts() == 1) # pretty tricky way to do this...

202

<b> How many people have the word "Chief" in their job title?</b>

In [28]:
filtered = list(filter(lambda t: "chief" in t.lower().split(), sal["JobTitle"]))

In [29]:
len(filtered)

477

<b>Is there a correlation between length of the job title string and Sal</b>

In [30]:
sal["title_len"] = sal["JobTitle"].apply(len)

In [120]:
sal[["JobTitle","title_len"]]

                                              JobTitle  title_len
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY         46
1                      CAPTAIN III (POLICE DEPARTMENT)         31
2                      CAPTAIN III (POLICE DEPARTMENT)         31
3                 WIRE ROPE CABLE MAINTENANCE MECHANIC         36
4         DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)         44
...                                                ...        ...
148649                                       Custodian          9
148650                                    Not provided         12
148651                                    Not provided         12
148652                                    Not provided         12
148653                      Counselor, Log Cabin Ranch         26

[148654 rows x 2 columns]

In [31]:
sal[["TotalPayBenefits","title_len"]].corr()

                  TotalPayBenefits  title_len
TotalPayBenefits          1.000000  -0.036878
title_len                -0.036878   1.000000

<h1> Well Done!</h1>